[
    {
        "id": "amazonses",
        "name": "Amazon Simple Email Service",
        "domains": [],
        "description": "Amazon Simple Email Service (also know as \"Amazon SES\") is an email platform promoted to businesses as a part of Amazon Web Services (AWS). Typically the recipient themselves will need to open a ticket with AWS support for in-depth troubleshooting if the issue can't be resolved using manual controls.",
        "links": [
            "https:\/\/docs.aws.amazon.com\/ses\/latest\/DeveloperGuide\/receiving-email.html"
        ]
    },
    {
        "id": "att",
        "name": "AT&T",
        "domains": [
            "att.net",
            "sbcglobal.net",
            "swbell.net",
            "bellsouth.net",
            "pacbell.net",
            "prodigy.com"
        ],
        "description": "AT&T offers free email accounts for past customers at sbcglobal.net and bellsouth.net, and new and non-customers can register an att.net or currently.com free email account. AT&T provides a detailed Postmaster page with contact options for investigating false-positive spam verdicts.",
        "links": [
            "https:\/\/www.att.com\/support\/article\/email-support\/KM1401980\/",
            "https:\/\/www.att.com\/support\/article\/email-support\/KM1010455\/"
        ]
    },
    {
        "id": "barracuda",
        "name": "Barracuda",
        "description": "Barracuda is a spam filter, block list, and firewall for businesses. Mail is routed through mailservers owned by Barracuda before it's passed along to the recipient domain's mailservers for final delivery. The recipient is able to manage a lot of delivery settings such as allow lists, but sender reputation issues that affect all Barracuda customers globally may require contacting Barracuda support directly to resolve.",
        "links": [
            "https:\/\/campus.barracuda.com\/product\/emailsecuritygateway\/doc\/39815000\/smtp-error-codes\/"
        ]
    },
    {
        "id": "cisco",
        "name": "Cisco",
        "description": "Cisco Secure Email is a spam filter, block list, and firewall solution for businesses. Mail is routed through mailservers owned by Cisco (iphmx.com) before it's passed along to the recipient domain's mailservers for final delivery. The recipient is able to manage a lot of delivery settings such a allow lists,so it helps to ask the recipient to run the described debugging tests in the user guide to identify and resolve delivery issues, as there is no way to contact the vendor directly.",
        "links": []
    },
    {
        "id": "comcast",
        "name": "Comcast",
        "domains": [
            "comcast.net"
        ],
        "description": "Comcast (also known as \"Xfinity\") is an American internet service provider that also provides email addresses to its customers. Former customers can still have access to their comcast.net address if they've logged in in the past 90 days, but that also means many of these addresses become inactive over time.",
        "links": [
            "http:\/\/postmaster.comcast.net\/"
        ]
    },
    {
        "id": "emailsecuritycloud",
        "name": "Email Security.cloud",
        "description": "\"Email Security.cloud\" is a product working in combination with \"Symantec Messaging Gateway\" as part of a range of services offered by Broadcom. It features spam filtering, firewall protection, and block lists. Mail is routed through mailservers owned by them (messagelabs.com) before it's passed along to the recipient domain's mailservers for final delivery. The recipient is able to manage a lot of delivery settings such a allow lists, so it helps to ask the recipient to run the described debugging tests in the user guide to identify and resolve delivery issues, as there is no way to contact the vendor directly.",
        "links": [
            "https:\/\/knowledge.broadcom.com\/external\/article\/165144\/smtp-bounce-back-error-codes-for-email-s.html",
            "https:\/\/ipremoval.sms.symantec.com\/"
        ]
    },
    {
        "id": "exchangeonline",
        "name": "Exchange Online Protection",
        "description": "Exchange Online Protection (EOP) is the spam filter for Microsoft 365, the business productivity suite from Microsoft. It provides businesses with spam filtering, block lists, and firewall protection. If a message is going to spam or getting blocked, there are typically instructions for the email admin to fix the specific error in Exchange documentation.",
        "links": [
            "https:\/\/docs.microsoft.com\/en-us\/exchange\/mail-flow-best-practices\/non-delivery-reports-in-exchange-online\/non-delivery-reports-in-exchange-online",
            "https:\/\/sender.office.com\/"
        ]
    },
    {
        "id": "fireeye",
        "name": "FireEye",
        "description": "FireEye is a spam filter, block list, and firewall solution for businesses. Mail is routed through mailservers owned by FireEye before it's passed along to the recipient domain's mailservers for final delivery. The recipient is able to manage a lot of delivery settings such a allow lists, so it helps to ask the recipient to run the described debugging tests in the user guide to identify and resolve delivery issues.",
        "links": []
    },
    {
        "id": "free",
        "name": "Free",
        "domains": [],
        "description": "Free is an internet service provider headquartered in France. It provides free email accounts to its customers, notably those of Free and Alice. Their postmaster page is filled with detailed information about error codes and IP lookup options, including instructions to report a false-positive spam verdict.",
        "links": [
            "https:\/\/postmaster.free.fr\/index_en.html"
        ]
    },
    {
        "id": "gmx",
        "name": "GMX",
        "domains": [],
        "description": "GMX is an email provider including Mail.com recipients, headquartered in Germany. Eurproean receivers tend to have high expectations for GDPR legal complaince, and in some cases email deliverability is aided when the sender is included in high profile \"whitelists\" and certification programs. You can use the GMX postmaster site to investigate most issues, and their contact form to submit things for in-depth investigation. You can also reach out to mailsecurity@gmxnet.de directly in urgent cases. ",
        "links": [
            "https:\/\/postmaster.gmx.com",
            "https:\/\/postmaster.gmx.net\/en\/contact"
        ]
    },
    {
        "id": "godaddy",
        "name": "GoDaddy",
        "domains": [
            "godaddy.com",
            "secureserver.net"
        ],
        "description": "GoDaddy is a domain hosting provider with a range of online services. It offers both email to its customers (via Microsoft 365) as well as email through their own platform (Profesional Email) email forwarding, as well as mail originating from their hosting platforms. secureserver.net is the domain used for their email servers. Any mail to or from a server with that domain will be controlled by GoDaddy All cases provide spam filtering with very little customization, but GoDaddy's support guide on SMTP errors also includes a link to a contact form for more investigation.",
        "links": [
            "https:\/\/ca.godaddy.com\/help\/what-does-my-email-bounceback-mean-3568",
            "https:\/\/checkspam.godaddy.com\/"
        ]
    },
    {
        "id": "google",
        "name": "Google",
        "domains": [
            "gmail.com",
            "googlemail.com"
        ],
        "description": "Google offers both a freemail option (Gmail) and a range of online services for business domains (Google Workspace). They boast total automation and machine learning as their spam filtering and anti-abuse systems. There are few methods for contacting a human to review delivery issues, since options for human intervention in these kinds of processes are also limited. Instead all senders should be monitoring their domains at Google Postmaster Tools daily for insight into reputation and performance.",
        "links": [
            "https:\/\/support.google.com\/a\/answer\/3726730?hl=en",
            "https:\/\/postmaster.google.com"
        ]
    },
    {
        "id": "hey",
        "name": "HEY",
        "domains": [],
        "description": "HEY is an email provider offered by the software company 37Signals. It's a paid service for both hey.com recipients and those with their own domain hosting email in the HEY app. HEY boasts especially strict spam filtering and a manual screening process per sender. There's little a sender can do to troubleshoot delivery, as the individual recipient decides which email addresses they accept mail from.",
        "links": [
            "https:\/\/hey.com\/how-it-works\/"
        ]
    },
    {
        "id": "hostpoint",
        "name": "Hostpoint",
        "domains": [],
        "description": "Hostpoint is a swiss-based web and email provider that provides email hosting for domains hosted at Hostpoint.",
        "links": [
            "https:\/\/support.hostpoint.ch\/en\/technical\/e-mail"
        ]
    },
    {
        "id": "icloud",
        "name": "iCloud",
        "domains": [
            "icloud.com",
            "me.com",
            "mac.com"
        ],
        "description": "iCloud provides Apple customers with free email accounts. Users can also link their custom domains to it. Their postmaster includes some basic deliverability recommendations, but troubleshooting requires contacting their Postmaster team.",
        "links": [
            "https:\/\/support.apple.com\/en-us\/HT204137"
        ]
    },
    {
        "id": "improvmx",
        "name": "ImprovMX",
        "domains": [],
        "description": "ImprovMX is an email forwarding service that lets you receive emails in your custom domain and forward them to your personal address.",
        "links": [
            "https:\/\/improvmx.com\/guides\/improvmx-error-codes\/"
        ]
    },
    {
        "id": "infomaniak",
        "name": "Infomaniak",
        "domains": [],
        "description": "Infomaniak is a swiss-based web and email provider that provides email hosting for domains bought at Infomaniak.",
        "links": [
            "https:\/\/www.infomaniak.com\/en\/support\/faq\/admin2\/e-mail-hosting"
        ]
    },
    {
        "id": "mailru",
        "name": "Mail.ru",
        "domains": [
            "mail.ru"
        ],
        "description": "Mail.ru is an internet service provider and email provider, headquartered in Moscow. They have strict published requirements for delivering mail, such as prohibiting the use of link shorteners. All senders should register their sending domains for Mail.ru's Postmaster Tools for direct insight into reputation and performance in the inbox.",
        "links": [
            "https:\/\/help.mail.ru\/enpostmaster\/mailing_rules",
            "https:\/\/help.mail.ru\/notspam-support\/errors",
            "https:\/\/postmaster.mail.ru\/"
        ]
    },
    {
        "id": "mimecast",
        "name": "Mimecast",
        "description": "Mimecast is a spam filter, block list, and firewall solution for businesses. Mail is routed through mailservers owned by Mimecast (*.mimecast.com) before it's passed along to the recipient domain's mailservers for final delivery. The recipient is able to manage a lot of delivery settings such a allow lists, so it helps to ask the recipient to run the described debugging tests in the user guide to identify and resolve delivery issues.",
        "links": [
            "https:\/\/community.mimecast.com\/s\/article\/Mimecast-SMTP-Error-Codes-842605754#451"
        ]
    },
    {
        "id": "mxroute",
        "name": "MXroute",
        "domains": [],
        "description": "MXroute is an email host obsessed with high IP reputation. Their offer a low-cost, no-frills solution that guarantees delivery of your corporate emails.",
        "links": []
    },
    {
        "id": "orange",
        "name": "Orange",
        "domains": [],
        "description": "Orange is an internet service provider that provides free email accounts to both its customers and registered non-customers, headquartered in France. Eurproean receivers tend to have high expectations for GDPR legal complaince, so after you've ensured the mail is legitimate and following all best practices, you can typically report false-positive blocks and spam filtering to Orange's \"Abuse Cell\" team to investigate.",
        "links": [
            "https:\/\/assistance.orange.fr\/ordinateurs-peripheriques\/depanner\/probleme-de-mail\/probleme-avec-la-reception-de-mails-douteux\/la-cellule-abuse-presentation_206348-41412#onglet3"
        ]
    },
    {
        "id": "outlook",
        "name": "Outlook",
        "domains": [
            "hotmail.com",
            "outlook.com",
            "msn.com",
            "live.com"
        ],
        "description": "Outlook is an email provider for predominantly Outlook, Hotmail, and Live freemail addresses, as part of Microsoft. For legitimate messages going to the spam filter or getting blocked, you'll likely need to file a false-positive report with Outlook support. For globally-blocked IPs, the adminstrator of the IP will need to request delisting directly.",
        "links": [
            "https:\/\/postmaster.live.com\/pm\/postmaster.aspx",
            "http:\/\/go.microsoft.com\/fwlink\/?LinkID=614866",
            "https:\/\/sender.office.com\/"
        ]
    },
    {
        "id": "proofpoint",
        "name": "Proofpoint",
        "description": "Proofpoint is a spam filter, block list, and firewall promoted for businesses. Mail is routed through mailservers owned by Proofpoint (*.pphosted.com or *.ppe-hosted.com) before it's passed along to the recipient domain's mailservers for final delivery. The recipient is able to manage a lot of delivery settings such a allow lists and spam filtering policy levels. For globally-blocked IPs, the adminstrator of the IP will need to request delisting directly.",
        "links": [
            "https:\/\/help.proofpoint.com\/Proofpoint_Essentials\/Email_Security\/User_Topics\/040_spamsettings\/041_adjustingyourspamsettings",
            "https:\/\/help.proofpoint.com\/Proofpoint_Essentials\/Email_Security\/Administrator_Topics\/110_logs\/Common_Error_Codes_found_in_Message_Details",
            "https:\/\/help.proofpoint.com\/Proofpoint_Essentials\/Email_Security\/Administrator_Topics\/Other_Features\/Proofpoint_Dynamic_Reputation_(PDR)_IP_blocklisting_and_IP_address_removal"
        ]
    },
    {
        "id": "protonmail",
        "name": "Proton Mail",
        "domains": [],
        "description": "Proton Mail is a swiss-based email provider and the largest end-to-end encrypted email host.",
        "links": []
    },
    {
        "id": "qq",
        "name": "QQ",
        "domains": [],
        "description": "QQ is an instant messaging service that includes email, social groups and games, and online chat products, headquartered in China as part of Tencent. Email delivery can be unpredicatable for non-Chinese businesses or when sending through mailservers outside of China. For the most insight, register your Return-Path domain with QQ's Postmaster site to directly monitor delivery and respond to any spam complaints.",
        "links": [
            "https:\/\/openmail.qq.com\/"
        ]
    },
    {
        "id": "rackspace",
        "name": "Rackspace",
        "domains": [],
        "description": "Rackspace is a range of online services promoted to businesses. It includes an email hosting product with spam filtering, firewall, and block list features. Their public postmaster page is especially informative, including email addresses you can contact to resolve special cases.",
        "links": [
            "https:\/\/postmaster.apps.rackspace.com\/home"
        ]
    },
    {
        "id": "rambler",
        "name": "Rambler",
        "domains": [],
        "description": "Rambler is a search engine and email provider, headquartered in Moscow. Besides a general contact form available in their support resources pages, you can also reach out to Rambler's abuse team directly at abuse@rambler-co.ru to investigate false-positive blocks.",
        "links": [
            "https:\/\/help.rambler.ru\/mail\/mail-soobsheniya-ob-oshibkah\/1326\/"
        ]
    },
    {
        "id": "trendmicro",
        "name": "Trend Micro",
        "description": "Trend Micro is a spam filter, block list, and firewall solution for businesses. Mail is routed through mailservers owned by Trend Micro (example: *.trendmicro.com). The recipient is able to manage a lot of delivery settings such a allow lists, so it helps to ask the recipient to run the described debugging tests in the user guide to identify and resolve delivery issues.",
        "links": [
            "https:\/\/docs.trendmicro.com\/en-us\/enterprise\/deep-discovery-email-inspector-36\/administration_001\/sender-filtering.aspx",
            "https:\/\/www.ers.trendmicro.com\/reputations\/index"
        ]
    },
    {
        "id": "webde",
        "name": "Web.de",
        "domains": [],
        "description": "Web.de is a search engine and email provider, headquartered in Germany. Eurproean receivers tend to have high expectations for GDPR legal complaince, and in some cases email deliverability is aided when the sender is included in high profile \"whitelists\" and certification programs.",
        "links": [
            "https:\/\/postmaster.web.de\/en\/error-messages"
        ]
    },
    {
        "id": "yahoo",
        "name": "Yahoo Inc",
        "domains": [
            "yahoo.com",
            "aol.com",
            "verizon.net"
        ],
        "description": "Known for its freemail services AOL and Yahoo, they provide a detailed Postmaster page with contact options for investigating false-positive spam verdicts. Some senders may also qualify for their \"Email Marketing Data Feeds\" with detailed insight on performance in the inbox.",
        "links": [
            "https:\/\/senders.yahooinc.com"
        ]
    },
    {
        "id": "yandex",
        "name": "Yandex",
        "domains": [
            "yandex.com"
        ],
        "description": "Yandex is a search engine and email provider, headquartered in Moscow. They have strict published requirements for delivering mail, such as details on the opt-in and unsubscribe process. They used to maintain a detailed postmaster tools site, but it was discontinued due to abuse of the service.",
        "links": [
            "https:\/\/yandex.com\/support\/mail\/web\/spam\/honest-mailers.html",
            "https:\/\/yandex.com\/support\/mail\/bounces\/yandex.html"
        ]
    },
    {
        "id": "zerospam",
        "name": "ZeroSpam",
        "description": "ZeroSpam is a spam filter, block list, and firewall promoted for businesses, headquartered in Quebec. Mail is routed through mailservers owned by ZeroSpam before it's passed along to the recipient domain's mailservers for final delivery. The recipient is able to manage a lot of delivery settings such as allow lists, but senders may also be able to contact a postmaster@zerospam.com and abuse@zerospam.com address to get more in-depth analysis.",
        "links": [
            "https:\/\/help.cumulussmtp.com\/article\/21-managing-filtering-parameters",
            "https:\/\/www.zerospam.ca\/en\/press-and-media-blog-archives\/archive-template-5\/archive-email-best-practices"
        ]
    },
    {
        "id": "zoho",
        "name": "Zoho",
        "domains": [
            "zoho.com"
        ],
        "description": "Zoho is a range of online services for businesses. It includes an email hosting product with spam filtering, firewall, and block list features.",
        "links": [
            "https:\/\/www.zoho.com\/mail\/help\/spam-reason.html"
        ]
    }
]